Тест_ЗУП_31_КОРП/src/Reports/ОценкиКандидатаРасшифровка/ОценкиКандидатаРасшифровка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОценкиКандидатаРасшифровка</name>
</mdclass:Report>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ОценкиКандидатовПоХарактеристикам/ОценкиКандидатовПоХарактеристикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиКандидатовПоХарактеристикам</name>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <basedOn>Document.ЗаявкаНаПодборПерсонала</basedOn>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодборПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыСКандидатами</name>
    <attributes>
      <name>ЭтапРаботы</name>
      <type>
        <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонАнкеты</name>
      <type>
        <types>CatalogRef.ШаблоныАнкет</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Reports/ОценкиКандидатаРасшифровка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует отчет по расшифровке оценки кандидата.
//
// Параметры 
//	Кандидат - СправочникСсылка.Кандидаты - кандидат, для которого формируется отчет. 
//	ТаблицаОтчета - ТабличныйДокумент - табличный документ для вывода отчета.
//
Процедура СформироватьОтчет(Кандидат, ТаблицаОтчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВакансииХарактеристикиПерсонала.Характеристика КАК Характеристика,
		|	ВакансииХарактеристикиПерсонала.Значение КАК ЗначениеХарактеристики,
		|	ВакансииХарактеристикиПерсонала.Вес КАК Вес,
		|	ВакансииХарактеристикиПерсонала.ВесЗначения КАК ВесЗначения,
		|	0 КАК МаксимальныйБалл,
		|	0 КАК Балл,
		|	0 КАК ОтносительныйБалл,
		|	0 КАК Коэффициент
		|ИЗ
		|	Справочник.Вакансии.ХарактеристикиПерсонала КАК ВакансииХарактеристикиПерсонала
		|ГДЕ
		|	ВакансииХарактеристикиПерсонала.Ссылка = &Вакансия
		|	И ВакансииХарактеристикиПерсонала.ТребуетсяПроверка
		|ИТОГИ
		|	МАКСИМУМ(Вес)
		|ПО
		|	Характеристика";
	Запрос.УстановитьПараметр("Вакансия", Кандидат.Вакансия);
	ДеревоХарактеристик = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФизическиеЛица = Новый СписокЗначений;
	ФизическиеЛица.Добавить(Кандидат.ФизическоеЛицо);
	ДанныеРасшифровки = ЭлектронноеИнтервью.РасшифровкаХарактеристикПоОтветам(Кандидат.Вакансия, ФизическиеЛица, Неопределено, Неопределено);
	
	Макет = Отчеты.ОценкиКандидатаРасшифровка.ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Кандидат = Кандидат;
	ТаблицаОтчета.Вывести(Шапка);
	
	ОбщийВес = ДеревоХарактеристик.Строки.Итог("Вес");
	Формулировка = "";
	Для Каждого ТекущаяХарактеристика Из ДеревоХарактеристик.Строки Цикл
		ИтоговыйБалл = 0;
		ОсновноеЗначение = Неопределено;
		Для Каждого СтрокаЗначения Из ТекущаяХарактеристика.Строки Цикл
			СтрокаЗначения.Коэффициент = 1;
			Если ДанныеРасшифровки.Строки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ВеткаХарактеристики = ДанныеРасшифровки.Строки[0].Строки.Найти(ТекущаяХарактеристика.Характеристика);
			Если ВеткаХарактеристики = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ВеткаЗначения = ВеткаХарактеристики.Строки.Найти(СтрокаЗначения.ЗначениеХарактеристики);
			Если ВеткаЗначения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаЗначения.МаксимальныйБалл = ВеткаЗначения.МаксимальныйБалл;
			СтрокаЗначения.Балл = ВеткаЗначения.Балл;
	        СтрокаЗначения.ОтносительныйБалл = ВеткаЗначения.ИтоговыйБалл;
			СтрокаЗначения.Коэффициент = ВеткаЗначения.Вес;
			Если ВеткаЗначения.ИтоговыйБалл > ИтоговыйБалл Тогда
				ИтоговыйБалл = ВеткаЗначения.ИтоговыйБалл;
				ОсновноеЗначение = СтрокаЗначения.ЗначениеХарактеристики;
			КонецЕсли;
		КонецЦикла;
		ТаблицаХарактеристики = Новый ТабличныйДокумент;
		ЕстьВыделеннаяСтрока = Ложь;
		Для Каждого СтрокаЗначения Из ТекущаяХарактеристика.Строки Цикл
			Если СтрокаЗначения.ОтносительныйБалл = ИтоговыйБалл И Не ЕстьВыделеннаяСтрока Тогда
				ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаВыделенная");
				ЕстьВыделеннаяСтрока = Истина;
			Иначе
				ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, СтрокаЗначения);
			ОбластьСтроки.Параметры.ОтносительныйБалл = Строка(СтрокаЗначения.Балл) + "/" + Строка(СтрокаЗначения.МаксимальныйБалл) + "*" + Формат(СтрокаЗначения.Коэффициент, "ЧДЦ=2; ЧН=0")
				+ " = " + Формат(СтрокаЗначения.ОтносительныйБалл, "ЧДЦ=2; ЧН=0") + "%";
			ОбластьСтроки.Параметры.ИтоговыйБалл = ИтоговыйБалл;
			СтруктураРасшифровки = Новый Структура;
			СтруктураРасшифровки.Вставить("ХарактеристикаПерсонала", ТекущаяХарактеристика.Характеристика);
			СтруктураРасшифровки.Вставить("ЗначениеХарактеристики", ОсновноеЗначение);
			ОбластьСтроки.Параметры.СтруктураРасшифровки = СтруктураРасшифровки;
			ТаблицаХарактеристики.Вывести(ОбластьСтроки);
		КонецЦикла;
		Область = ТаблицаХарактеристики.Область(1, 1, ТекущаяХарактеристика.Строки.Количество(), 1);
		Область.Объединить();
	    Область = ТаблицаХарактеристики.Область(1, 2, ТекущаяХарактеристика.Строки.Количество(), 2);
		Область.Объединить();
	    Область = ТаблицаХарактеристики.Область(1, 9, ТекущаяХарактеристика.Строки.Количество(), 9);
		Область.Объединить();
		ТаблицаОтчета.Вывести(ТаблицаХарактеристики);
		
		Формулировка = Формулировка + ?(ЗначениеЗаполнено(Формулировка), " + ", "") + Строка(ТекущаяХарактеристика.Вес) + "/" + Строка(ОбщийВес) + "*" + Формат(ИтоговыйБалл, "ЧДЦ=2; ЧН=0");
	КонецЦикла;
	
	ИтоговыйБалл = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОценкиКандидатовПоХарактеристикам.Оценка КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиКандидатовПоХарактеристикам КАК ОценкиКандидатовПоХарактеристикам
		|ГДЕ
		|	ОценкиКандидатовПоХарактеристикам.Кандидат = &Кандидат";
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Оценка) Тогда
			ИтоговыйБалл = Выборка.Оценка;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьИтогов = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогов.Параметры.Вес = ОбщийВес;
	ОбластьИтогов.Параметры.Формула = Формулировка + " = ";
	ОбластьИтогов.Параметры.ИтоговыйБалл = ИтоговыйБалл;
	ТаблицаОтчета.Вывести(ОбластьИтогов);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
